In [ ]:
#Loading Data

In [1]:
#Panda similar a excel
import pandas as pd
#Numpy operaciones matematicas avanzadas 
import numpy as np
#Seaborn para data xamples and visualzar el desarrollo
import seaborn as sns

In [10]:
df1 = pd.read_csv("C:/Users/Michael Pannwitz/Desktop/Python_EDegree/Demo1.csv")

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [11]:
df1

     ID;Name
0    1;Erick
1    2;Grace
2     3;Joan
3   4;Marcio
4     5;Luis
5   6;Harvey
6   7;German
7  8;Rolando

In [18]:
df2 = pd.read_excel("C:/Users/Michael Pannwitz/Desktop/Python_EDegree/Demo1.xlsx")

In [14]:
type(df2)

pandas.core.frame.DataFrame

In [19]:
df2

   ID     Name
0   1    Erick
1   2    Grace
2   3     Joan
3   4   Marcio
4   5     Luis
5   6   Harvey
6   7   German
7   8  Rolando

In [ ]:
#great seaborn data sets easily load 
#https://github.com/mwaskom/seaborn-data

In [24]:
#reading in sample data - great for experimentation - for seaborn
#list of all read ins for sns datasets
df_anscombe=sns.load_dataset("anscombe")
df_attention=sns.load_dataset("attention")
df_brain_networks=sns.load_dataset("brain_networks")
df_car_crashes=sns.load_dataset("car_crashes")
df_diamonds=sns.load_dataset("diamonds")
df_dots=sns.load_dataset("dots")
df_exercise=sns.load_dataset("exercise")
df_flights=sns.load_dataset("flights")
df_fmri=sns.load_dataset("fmri")
#df_gammas=sns.load_dataset("gammas")
df_geyser=sns.load_dataset("geyser")
df_iris=sns.load_dataset("iris")
df_mpg=sns.load_dataset("mpg")
df_penguins=sns.load_dataset("penguins")
df_planets=sns.load_dataset("planets")
df_tips=sns.load_dataset("tips")
df_titanic=sns.load_dataset("titanic")

In [25]:
#checking our data 
df_tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [26]:
type(df_tips)

pandas.core.frame.DataFrame